app/controllers/flashlights_controller.rb

SELECT "flashlights".* FROM "flashlights"
---
  def index
    @flashlights = Flashlight.all